import Link from "next/link";

const Privacy = () => {
  return (
    <div>
      <Link href="/">
        <a>뒤로가기</a>
      </Link>
      <h1>개인정보 처리 방침</h1>
      <p>
        주식회사 알에스팀에서 운영하는 'https://next-test.rs-team.co.kr'는
        고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한
        법률을 준수하고 있습니다. 회사는 개인정보취급방침을 통하여 고객님께서
        제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며,
        개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. 회사는
        개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을
        통하여 공지할 것입니다. 본 방침은 : 2022 년 04 월16 일부터 시행됩니다.
        <br />
        <br />
        01. 수집하는 개인정보 항목 회사는 회원가입, 상담, 서비스 신청 등등을
        위해 아래와 같은 개인정보를 수집하고 있습니다. 수집항목 : 이름,
        로그인ID, 비밀번호, 자택 전화번호, 휴대전화번호, 이메일, 회사 전화번호,
        이용자 주소, 서비스 이용기록, 접속 로그, 쿠키, 접속IP 정보, 결제기록 등.
        개인정보 수집방법 : 홈페이지를 통한 외부 api 사용 및 내부 api 사용 등.
        <br />
        <br />
        02. 개인정보의 수집목적 및 이용목적 회사는 이용자들이 본 웹사이트를
        최대한 효과적으로 이용하도록 하기 위하여 반드시 필요한 최소한의 정보만을
        요구합니다. 회원님의 개인정보를 수집하는 또 다른 목적은 회사 사이트를
        통하여 회원님께 최적의 맞춤화된 서비스를 제공하기 위해서입니다.
        회원님께서 제공해주신 개인정보를 바탕으로 회원님께 보다 더 유용한 정보를
        선택적으로 제공하는 것이 가능합니다. 회사는 수집한 개인정보를 다음의
        목적을 위해 활용합니다. 서비스 제공에 관한 계약 이행 및 서비스 제공에
        따른 요금정산 및 요금 결제, 요금추심 회원 관리 회원제 서비스 이용에 따른
        본인확인, 개인 식별, 가입 의사 확인, 불만처리 등 민원처리, 고지사항 전달
        합니다.
        <br />
        <br />
        03. 개인정보를 제3자에게 제공하는 경우의 제공받는 자, 제공목적 및 제공할
        정보의 내용 회사는 일반적으로 개개인의 개인정보를 공유하거나 제3자에게
        제공하지 않습니다. 회사의 게시판 등에 이용자가 자발적으로 입력하지 않는
        이상 개인 정보는 유출되지 않습니다. 다만, 원활한 예약을 위하여
        고객님께서 예약하신 렌터카, 숙소, 항공사, 골프장, 결제대행, 홈페이지
        운영회사 등에는 고객님의 개인정보가 제공되며 내용은 다음과 같습니다.
        <br />
        <br />
        서비스제공 및 관계법령의 보존기간 * 개인정보를 제3자에게 제공하는 경우,
        이용자에게(제공받는자,제공목적,제공항목,보유 및 이용기간의 동의를
        구하며, 동의사항에 대한 변경이 있을경우, 별도의 재동의를 획득하는
        조건입니다 또한, 다음의 경우에는 예외로 합니다. 이용자들이 사전에 동의한
        경우, 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와
        방법에 따라 수사기관의 요구가 있는 경우, 학술적 목적의 통계자료,
        시장조사, 통계처리 등을 위하여 필요한 경우 (이 경우는 개인 각각의 식별이
        불가능한 형태로만 정보가 제공될 수 있습니다.)
        <br />
        <br />
        04. 수집한 개인정보의 위탁 회사는 고객님의 동의없이 고객님의 정보를 외부
        업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위탁 대상자와
        위탁 업무 내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록
        하겠습니다.
        <br />
        <br />
        05. 동의 철회, 열람, 정정 요구 및 탈퇴 등 이용자의 권리 및 그 행사방법
        회원님은 언제든지 등록되어 있는 회원님의 개인정보를 열람하거나 정정하실
        수 있으며, 회원탈퇴를 요청하실 수 있습니다. 회원님 개인정보의 열람,
        정정은 회사 이메일"tmdqjaha12@rs-team.com"에서 언제든지 열람, 정정이
        가능합니다.
        <br />
        <br />
        06. 개인정보의 보유 및 이용기간 회원님의 개인정보는 회원가입시부터
        탈퇴시까지만 서비스 이용을 위하여 보유하게 되며 회원탈퇴시 재생할 수
        없는 방법으로 파기됩니다. 단, 회원탈퇴를 하신 경우라도 소송이나 분쟁의
        대비 등을 위하여 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안
        고객님의 개인정보는 보관되며, 이 때 보괸된 개인정보의 열람 및 이용은
        해당 사유로 국한됩니다.
        <br />
        <br />
        - 보존 항목 : 이름, 로그인ID, 자택 전화번호, 휴대전화번호, 이메일,
        회사전화번호, 서비스 이용기록 - 보존 근거 : 전자상거래등에서의
        소비자보호에 관한 법률 - 보존 기간 : 5년 또는 회원탈퇴시까지 보관 - 계약
        또는 청약철회 등에 관한 기록 : 5년 (전자상거래등에서의 소비자보호에 관한
        법률) - 대금결제 및 재화 등의 공급에 관한 기록 : 5년 (전자상거래등에서의
        소비자보호에 관한 법률) - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
        (전자상거래등에서의 소비자보호에 관한 법률)
        <br />
        <br />
        07. 쿠키의 운영에 관한 사항 회사는 쿠키를 이용자의 브라우저 파일에
        저장할 수 있습니다. 쿠키는 소용량의 컴퓨터 파일로서 서버가 이용자들의
        인터넷 이용습관을 분석하기 위해 사용하는 파일입니다. 쿠키는 개인적인
        정보를 수집할 수 없으며, 다만 이용자의 인터넷 이용습관에 대한 정보만을
        수집할 수 있습니다. 이렇게 수집된 정보로는 이용자를 파악할 수 없으며,
        이용자들에게 연락을 취할 수도 없습니다. 이용자는 웹브라우저에서 옵션을
        설정함으로서 모든 쿠키를 허용할 수도 있고, 매번 확인을 거치거나, 모든
        쿠키의 저장을 거부할 수도 있습니다. - 설정방법 예(인터넷 익스플로어의
        경우) : 웹 브라우저 상단의 도구 &gt; 인터넷 옵션 &gt; 개인정보 (다만,
        쿠키의 저장을 거부할 경우에는 서비스 이용에 어려움이 있을 수 있습니다.)
        <br />
        <br />
        08 개인정보의 파기절차 및 방법 회사는 원칙적으로 개인정보 수집 및
        이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 파기절차 및
        방법은 다음과 같습니다. 파기절차는 회원님이 회원가입 등을 위해 입력하신
        정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함)
        내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간
        참조) 일정 기간 저장된 후 파기되어집니다. 별도 DB로 옮겨진 개인정보는
        법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지
        않습니다. 파기방법은 전자적 파일형태로 저장된 개인정보는 기록을 재생할
        수 없는 기술적 방법을 사용하여 삭제합니다.
        <br />
        <br />
        09. 이용자 및 법정대리인의 권리와 그 행사방법 이용자 및 법정 대리인은
        언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를
        조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다. 이용자 혹은
        만 14세 미만 아동의 개인정보 조회/수정을 위해서는 ‘개인정보변경’ (또는
        ‘회원정보수정’ 등)을 통해서 본인 확인 절차를 거치신 후 직접 열람, 정정할
        수 있습니다. 또한 가입해지(동의철회)를 위해서는 개인정보관리책임자에게
        이메일(jeju-the-rentcar@matam.co.kr)또는 전화(1522-7225)로 연락주시거나
        회사 사이트 "마이페이지 메뉴의 회원탈퇴신청"란을 이용하시면 본인 확인
        절차를 거친 후 지체없이 조치하겠습니다. 귀하가 개인정보의 오류에 대한
        정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용
        또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한
        경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록
        하겠습니다. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는
        삭제된 개인정보는 “회사가 수집하는 개인정보의 보유 및 이용기간”에 명시된
        바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고
        있습니다.
        <br />
        <br />
        10. 개인정보에 관한 민원서비스 회사는 고객의 개인정보를 보호하고
        개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및
        개인정보관리책임자를 지정하고 있습니다.귀하께서는 회사의 서비스를
        이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자
        혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해
        신속하게 충분한 답변을 드릴 것입니다.
        <br />
        <br />
        개인정보관리 책임자 - 이름 : 하승범 - 전화 : 010-4112-7397 - 이메일 :
        tmdqjaha12@rs-team.com 기타 개인정보침해에 대한 신고나 상담이 필요하신
        경우에는 아래 기관에 문의하시기 바랍니다.
        <br />
        <br />- 개인분쟁조정위원회 (www.1336.or.kr/1336) -
        정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4) - 대검찰청
        인터넷범죄수사센터 (http://icic.sppo.go.kr/02-3480-3600) - 경찰청
        사이버테러대응센터 (www.ctrc.go.kr/02-392-0330)
      </p>
    </div>
  );
};

export default Privacy;
