import Link from "next/link";

const Terms = () => {
  return (
    <div>
      <Link href="/">
        <a>뒤로가기</a>
      </Link>
      <h1>개인정보 처리 방침</h1>
      <p>
        제1장 총칙
        <br />
        <br />
        제1조 (목적) 본 약관은 RS-TEAM에서 운영하는
        "https://next-test.rs-team.co.kr에서 제공하는 인터넷 관련 서비스(이하
        "서비스"라 한다)의 이용에 관한 사항을 규정함을 목적으로 합니다.
        <br />
        <br />
        제2조 (정의) "회사"란 https://next-test.rs-team.co.kr가 외부 및 내부
        API를 이용자에게 제공하기 위하여 컴퓨터 등 정보통신 설비를 이용하여
        기능들을 확인할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 그
        영업장을 운영하는 사업자의 의미로도 사용합니다. "이용자"란 "회사"에
        로그인하여 본 약관에 따라 "회사"가 제공하는 서비스를 받는 자를 말합니다.
        "회원"이란 "회사"와 "회사" 회원가입계약을 체결한 자를 말합니다.
        "회원ID"란 회원의 식별과 회원이 "회사"의 서비스를 이용하기 위하여,
        회원이 설정하고 "회사"가 승인하여 만들어진 문자와 숫자의 조합을
        말합니다. "개인정보"라 함은 당해 정보에 포함되어 있는 성명, 연락처 등의
        사항에 의하여 특정 개인을 식별할 수 있는 정보(당해 정보만으로는 특정
        개인을 인식할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는
        것을 포함합니다)를 말합니다.
        <br />
        <br />
        제3조 (약관의 게시 및 변경) 본 약관은 "회사" 서비스
        화면(https://next-test.rs-team.co.kr)에 게시되어 있습니다. "회사"은 관련
        법에 위배하지 않는 범위 내에서 본 약관을 개정할 수 있으며, 개정 시에는
        그 개정 사실 과 개정 후의 약관을 "회사" 상에 게시합니다. "회사"가 약관을
        개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만
        적용되고 그 이 전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이
        그대로 적용됩니다. 다만 "회사"가 "이용자가 상당한 기간 내에 변경 약관에
        대한 동의 여부를 표명하지 아니하는 때에는 변경약관의 적용을 받는 것으로
        본다"는 취지의 통지를 하였음에도 이용고객이 동의 여부를 표명하지 아니한
        경우 또는 부득이한 사유로 그러한 통지를 할 수 없는 경우에는 개정 전에
        체결된 계약에도 개정약관이 적용됩니다.
        <br />
        <br />
        제4조 (서비스의 내용 및 변경) "회사"는 다음의 서비스를 제공합니다. 여행
        관련 상품 등에 대한 정보의 제공 및 예약, 구매계약 체결 및 기타 "회사"가
        정하는 서비스를 제공합니다. "회사"는 불가피한 여건이나 사정이 있는 경우
        제공하는 서비스의 내용을 변경할 수 있습니다. "회사"는 제2항의 사유로
        서비스 내용이 변경되는 경우, 이로 인하여 이용자가 입은 손해에 대하여는
        배상하지 아니합니다. 단, "회사"의 고의 또는 중과실이 있는 경우에는
        그러하지 아니합니다.
        <br />
        <br />
        제5조 (서비스의 중단) "회사"는 시스템 등 장치의 보수점검·교체, 시스템의
        고장, 통신의 두절, 기타 불가항력적 사유가 발생한 경우에는 서비스의
        제공을 일시적으로 중단할 수 있습니다. "회사"는 제1항의 사유로 서비스
        제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에
        대하여는 배상하지 아니합니다. 단, "회사"의 고의 또는 중과실이 있는
        경우에는 그러하지 아니합니다.
        <br />
        <br />
        제6조 (약관 외 준칙) 본 약관에 명시되지 않은 사항은 전자거래기본법,
        전자서명법, 방문판매법 및 기타 관련 법령의 규정에 의합니다.
        <br />
        <br />
        제2장 회원가입계약 제7조 (회원가입) "회사"의 서비스를 이용하려는 자는
        "회사"가 정한 양식에 따라 회원정보를 기입한 후 본 약관에 동의 한다는
        의사표시를 함으로써 회원가입을 신청합니다. "회사"는 전항과 같이 회원으로
        가입할 것을 신청한 이용자 중 이하 각 호에 해당하지 않는 한 회원으로
        등록합니다. 가입신청자가 본 약관 제8조 제2항에 의거하여 이전에 회원
        자격을 정지, 상실한 적이 있는 경우 등록내용에 허위, 기재누락, 오기가
        있는 경우 기타 회원으로 등록하는 것이 "회사"의 기술상 또는 업무 수행상
        현저히 지장이 있다고 판단하는 경우 회원가입계약의 성립시기는 "회사"가
        승낙한 시점으로 합니다. 회원은 등록사항에 변경이 있는 경우, 즉시
        전자우편 기타 방법으로 "회사"에 대하여 그 변경사항을 알려야 합니다.
        <br />
        <br />
        제8조 (회원 탈퇴 및 자격의 상실) 회원이 사망한 때는 회원자격을
        상실합니다. 회원이 다음 각호의 사유에 해당하는 경우, "회사"는 회원자격을
        정지 또는 상실시킬 수 있습니다. 등록 신청 시에 허위 내용을 등록한 경우
        "회사"를 이용하여 구입한 상품 등의 대금, 기타 "회사" 이용에 관련하여
        회원이 부담하는 채무를 기일에 지급하지 않는 경우 "회사"에 제공되는
        정보를 변경하는 등 "회사"의 운영을 방해한 경우 본 약관에 위반한 경우
        기타 회원으로서의 자격을 지속시키는 것이 부적절하다고 판단되는 경우
        <br />
        <br />
        제9조 (회원에 대한 통지) "회사"가 회원에 대한 통지를 하는 경우, 회원이
        "회사"에 제출한 전자우편 주소로 할 수 있습니다. "회사"는 불특정다수
        회원에 대한 통지의 경우 게시판에 게시함으로써 개별 통지에 갈음할 수
        있습니다.
        {/*  

 
제3장 예약 계약
제10조 (예약 및 결제)
"회사"에서의 상품 등 예약은 회원 / 비회원 모두 가능합니다. "회사" 회원은 이하의 방법에 의하여 예약 신청을 합니다. 인터넷("회사")상에서 예약 신청하는 방법, 전화로 예약 신청하는 방법

 
제11조 (예약 계약의 성립) 
"회사"는 전조와 같은 예약 신청에 대하여 이하 각 호에 해당하지 않는 한 승낙합니다. 신청 내용에 허위, 기재누락, 오기가 있는 경우, 기타 신청에 승낙하는 것이 "회사" 기술상 또는 업무 수행상 현저히 지장이 있다고 판단하는 경우
"회사"가 승낙을 한 시점에 예약이 성립한 것으로 봅니다. 회원이 국내 여행상품 등(패키지)을 예약시, 여행업 표준약관 (공정거래위원회 승인약관 2003.01.29일자 개정 승인)을 적용합니다. 단, 상품별 특별 약관이 있는 경우, 특별 약관을 우선 적용합니다.
 

 
제4장 대금결제
제12조 (대금결제방법)
상품 등의 구매에 대한 결제는 다음의 방법에 의합니다. "회사"가 승인하는 신용카드에 의한 결제, "회사"가 지정하는 은행계좌에 대한 현금 입금
 
제13조 (연체)
상품 등의 구매에 대한 신용카드 결제가 연체되는 경우, 회원이 지정하는 신용카드 회사의 약관이 적용되며, 신용카드회사로부터 "회사"에 카드가 무효 또는 판매부인의 통지가 있는 경우 "회사"는 즉시 회원의 "회사" 이용을 일단 정지하고 (ID 및 비밀번호 사용정지), 회원에 대해 익월부터 대금결제방법의 변경여부에 대한 확인연락을 합니다. 신용카드회원이 "회사"에 제출한 연락처로 연락이 되지 않을 경우 또는 지정일까지 확인이 되지 않는 경우 "회사"는 당해 회원과의 계약을 해제, 해지하고 자격상실 처리를 합니다.
 
제5장 취소, 환불
제14조 (취소 및 환불)
여행상품의 예약 상황이 완료된 이후에 계약을 해지할 경우 여행업 표준약관 (공정거래위원회 승인약관 2003.01.29일자 개정 승인) 및 국내 소비자피해보상규정에 의거 손해배상액을 공제하고 환불합니다. 여행상품의 취소 규정은 성수기가 아닌 일반일정의 경우 결제 익일부터 취소수수료가 발생되며 여행일정 당일, 또는 렌트카 인수 당일의 취소는 100%의 수수료가 적용됩니다. 성수기의 취소 수수료는 별도로 추가 취소수수료가 발생됩니다. 

 
 
제6장 적립금의 지급
제15조 (적립금의 적립)
적립금는 회원에게만 적립됩니다.
"회사"에서 상품 등을 구매하는 "회사" 회원에게는 각 상품 등 별로 "회사"가 정하는 바에 따라 적립금이 적립됩니다. "회사"는 적립금의 금액을 회원이 상품 등을 구매하기 전에 알 수 있도록 게시합니다. "회사"는 제2항의 경우 외에 필요하다고 인정하는 경우 회원에 대하여 적립금을 적립할 수 있습니다. "회사"에서 상품 등을 구매함으로써 취득한 적립금은, 회원이 해당 상품 등의 구매를 취소 또는 환불하였을 경우, 적립이 취소됩니다.
 
제16조 (적립금의 환불)
적립금는 제3자에게 양도할 수 없습니다. 적립금은 현금으로 환불되지 않습니다. 회원 탈퇴 또는 회원자격상실의 경우 적립된 적립금은 모두 소멸됩니다. */}
        <br />
        <br />
        제7장 "회사"와 이용자 및 회원의 의무사항 제17조 (개인정보의 보호)
        "회사"는 회원의 개인정보를 수집하는 때에는 당해 회원의 동의를 받습니다.
        단, 이하 각 호의 경우는 그러하지 아니합니다. 법률에 특별한 규정이 있는
        경우, 전자거래 계약의 이행을 위해서 필요한 경우, 상품 등의 제공에 따른
        요금정산을 위하여 필요한 경우, "회사"는 개인정보의 목적 외 이용 및
        제3자에게 제공 시 당해 회원의 동의를 받습니다. 단, 이하 각 호의 경우는
        그러하지 아니합니다. 법률에 특별한 규정이 있는 경우, 상품 등의 제공에
        따른 요금정산을 위하여 필요한 경우, 특정개인을 식별할 수 없는 통계작성,
        홍보자료, 학술연구, 시장조사 등의 목적일 경우, 회원은 언제나 자신의
        정보를 열람, 정정하거나 삭제를 요청할 수 있으며, "회사"는 요청을 받는
        즉시 삭제 등 처리를 해야 합니다.
        <br />
        <br />
        제18조 (지급정보의 보호) "회사"는 회원이 안심하고 인터넷서비스를 이용할
        수 있도록 개개인의 지급 정보 보호를 위해 최선의 제도적, 기술적 장치의
        노력을 다 합니다.
        <br />
        <br />
        제19조 ("회사"의 의무) "회사"는 본 약관이 정하는 바에 따라 지속적이고,
        안정적인 서비스를 제공하는데 최선을 다하여야 합니다. "회사"는 항상
        회원의 신용정보를 포함한 개인신상정보의 보안에 대하여 기술적 안전 조치를
        강구하고 관리에 만전을 기함으로써 이용자의 정보보안에 최선을 다하여야
        합니다. "회사"는 공정하고 건전한 운영을 통하여 전자상거래 질서 유지에
        최선을 다하고, 지속적인 연구·개발을 통하여 양질의 서비스를 제공함으로써
        고객만족을 극대화하여 인터넷 비즈니스 발전에 기여하도록 합니다. "회사"는
        소비자보호단체의 소비자보호 업무의 추진에 필요한 자료 등의 제공요구에
        적극 협력합니다.
        <br />
        <br />
        제20조 (회원의 ID 및 비밀번호에 대한 의무)&gt; 회원은 "회사"를 이용하는
        경우 ID 및 비밀번호를 사용해야 합니다. ID와 비밀번호에 관한 모든 관리의
        책임은 회원에게 있습니다. 회원은 ID 및 비밀번호를 제3자에게 이용하게
        해서는 안됩니다. ID 및 비밀번호의 관리상 불충분, 사용상의 과실, 제3자의
        사용 등에 의한 손해의 책임은 회원이 집니다. 회원은 ID 및 비밀번호를
        도난당하거나 제3자에게 사용되고 있음을 인지한 경우에는 바로 "회사"에
        통보하고 "회사"의 지시가 있는 경우에는 그에 따라야 합니다.
        <br />
        <br />
        제21조 (이용자 및 회원의 의무) 이용자 및 회원은 다음의 행위를 하여서는
        안됩니다. 신청 또는 변경시 허위내용의 등록, "회사"에 게시된 정보의 변경,
        "회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시,
        "회사" 기타 제3자의 저작권 등 지적재산권에 대한 침해, "회사" 운영의
        방해, "회사"는 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위,
        외설 또는 폭력적인 메시지·화상·음성 기타 공서양속에 반하는 정보를
        "회사"에 공개 또는 게시하는 행위, 기타 "회사"가 부적절하다고 판단하는
        행위, 전항 각 호의 정보 기타 "회사"가 "회사" 운영상 부적절하다고 판단한
        정보가 "회사"에 게시되거나 "회사"와 링크된 곳에 게시된 경우, "회사"는
        이용자 또는 회원 기타 정보의 게시를 행한 자의 승낙없이 "회사"에 게재된
        당해 정보를 삭제하거나 "회사"에 확장된 링크를 절단할 수 있습니다. 단,
        "회사"는 이러한 정보의 삭제·링크의 절단 등을 할 의무를 지지 않습니다.
        <br />
        <br />
        제8장 기타 제22조 ("회사"와 "회사" 연결 사이트간의 관계) "회사"는 "회사"
        연결 사이트가 취급하는 상품 등에 대하여 보증책임을 지지 않습니다.
        "회사"와 "회사" 연결 사이트는 독자적으로 점포를 운영하는 것으로 "회사"는
        "회사" 연결 사이트와 이용자 간에 행해진 거래에 대하여 어떠한 책임도 지지
        않습니다.
        <br />
        <br />
        제23조 (저작권의 귀속 및 이용제한) "회사"가 작성한 "회사"에 관한 저작권
        기타 지적재산권은 "회사"에 귀속합니다. 이용자 및 회원은 "회사"를
        이용함으로써 얻은 정보를 "회사"의 사전 승낙 없이 복제, 송신, 출판, 배포,
        전송, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게
        하여서는 안됩니다. 단, 이용자 및 회원이 사적으로 이용하는 경우는
        그러하지 아니합니다.
        <br />
        <br />
        제24조 (불만처리) 회원은 "회사" 서비스 이용과 관련하여 불만이 있거나
        의견을 제시하고자 하는 경우에는 "회사"에 불만사항 또는 의견을 제출하면
        됩니다. "회사"는 회원으로부터 제출되는 불만사항 및 의견이 정당하다고
        판단하는 경우 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가
        곤란한 경우에는 회원에게 그 사유와 처리일정을 즉시 통보해 드립니다.
        <br />
        <br />
        제25조 (관할법원 및 준거법) 본 약관과 관련한 소송은 제주지방법원에
        제기할 수 있습니다. 이 약관의 준거법은 대한민국법으로 합니다.
        <br />
        <br />
        &lt;부 칙 &gt; 이 약관은 2022 년 04 월 16 일부터 그 효력을 발휘합니다.
      </p>
    </div>
  );
};

export default Terms;
